# 1、书写一个程序，用户输入一个数字（圆的半径）要求输出该圆的半径、周长和面积，输出格式如下：
# 	 该圆半径为：xx
# 	 该圆周长为：xx
# 	 该圆面积为：xx
#import math
#radius = input('请输入圆的半径：')
#radius = int(radius)
#pi = math.pi
#print('该圆的半径为{0:d}'.format(radius))
#print('该圆的周长为{0:f}'.format(radius * 2* pi))
#print('该圆的面积为{0:10.2f}'.format(radius**2*pi))

# 2、解释以下程序的打印结果
#print(1 + 10 * 2 / 2 - 5)
#print(3.0 / 5)
#print(3.0 // 5)
#print('a' * 10)
#print(True + 3)
#print(False + 3)
#print('hello' > 'world')

# 3、说出以下正确的定义变量有哪些？
# ab = 10          对✅
# *a = 20   不能加其他的东西，只能加英文，和_
# _a = 20       对✅
# pass = 1    不能加关键字
# global = 2      不能加关键字
# 1a = "hello"    不能加数字    (橙色是关键字)
# b = '''world'''    对✅
# python = ""hi""    对✅️

# 4. 定义一个变量。用来存储我卡上有100块钱，到银行存了1000块钱，打印输出现在我卡上多少钱
#card = 100
#card += 1000
#card += 1000  等于 card = card + 1000
# 5、班费有199块钱，买了30支笔，每支笔2.5元，买了5个杯子，5元一个，打印输出班费还剩多少钱？
account = 199-(30*2.5)-(5*5)

# 6. 使用运算符，求19的个位打印输出；求29的十位数字打印输出；189的每位数字输出；
print(19%10)
print(29//10)
print(189//100,189%100//10,189%10)

# 7 、已知一个学生两科成绩：语文90；英语66；求该学生总成绩和平均成绩PRINT
print(90+66,(90+66)/2)

# 8、已知正方形边长为4，求正方形周长和面积
n = 4
print('周长 %f 面积 %f' % (4*n,n**2))

# 9、已知一个圆半径为3.5，声明一个变量名为radius存储该圆半径，要求输出该圆的半径、周长和面积
n = 3.5
